{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "output_shape": null, "input_dtype": "float32", "arguments": {}, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa$/Users/jsp/work/sdc/cloning/model.py\u00da\b<lambda>S\u0001\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "Normalization"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "W_regularizer": null, "name": "ColorSpace", "bias": true, "nb_col": 1, "nb_filter": 3, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 1, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [2, 2], "activity_regularizer": null, "activation": "elu", "dim_ordering": "tf", "W_regularizer": null, "name": "Conv1", "bias": true, "nb_col": 5, "nb_filter": 24, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 5, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "elu", "dim_ordering": "tf", "W_regularizer": null, "name": "Conv2", "bias": true, "nb_col": 5, "nb_filter": 36, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 5, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "elu", "dim_ordering": "tf", "W_regularizer": null, "name": "Conv3", "bias": true, "nb_col": 5, "nb_filter": 48, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 5, "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "elu", "dim_ordering": "tf", "W_regularizer": null, "name": "Conv4", "bias": true, "nb_col": 3, "nb_filter": 64, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "b_regularizer": null, "subsample": [1, 1], "activity_regularizer": null, "activation": "elu", "dim_ordering": "tf", "W_regularizer": null, "name": "Conv5", "bias": true, "nb_col": 3, "nb_filter": 64, "W_constraint": null, "init": "glorot_uniform", "trainable": true, "nb_row": 3, "b_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "input_dim": null, "b_regularizer": null, "name": "FC1", "bias": true, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 50, "input_dim": null, "b_regularizer": null, "name": "FC2", "bias": true, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 10, "input_dim": null, "b_regularizer": null, "name": "FC3", "bias": true, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activity_regularizer": null, "output_dim": 1, "input_dim": null, "b_regularizer": null, "name": "output", "bias": true, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null}}]}