{"config": [{"config": {"arguments": {}, "name": "Normalization", "output_shape_type": "raw", "output_shape": null, "trainable": true, "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-30-4fd9b3bdec2e>\u00da\b<lambda>\u0006\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "name": "Conv1", "bias": true, "subsample": [2, 2], "b_constraint": null, "activation": "elu", "nb_filter": 24, "init": "glorot_uniform", "nb_col": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "name": "Conv2", "bias": true, "subsample": [2, 2], "b_constraint": null, "activation": "elu", "nb_filter": 36, "init": "glorot_uniform", "nb_col": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 5, "name": "Conv3", "bias": true, "subsample": [2, 2], "b_constraint": null, "activation": "elu", "nb_filter": 48, "init": "glorot_uniform", "nb_col": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "name": "Conv4", "bias": true, "subsample": [1, 1], "b_constraint": null, "activation": "elu", "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "nb_row": 3, "name": "Conv5", "bias": true, "subsample": [1, 1], "b_constraint": null, "activation": "elu", "nb_filter": 64, "init": "glorot_uniform", "nb_col": 3, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "name": "FC1"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "name": "FC2"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "name": "FC3"}, "class_name": "Dense"}, {"config": {"W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "activation": "linear", "b_constraint": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform", "name": "output"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}